{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4",
  "convertedBy": "TensorFlow.js Converter v1.0.1",
  "modelTopology": {
    "keras_version": "2.2.4",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "resnet50",
        "layers": [
          {
            "name": "input_5",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                224,
                224,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_5"
            },
            "inbound_nodes": []
          },
          {
            "name": "conv1_pad",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "conv1_pad",
              "trainable": true,
              "padding": [
                [
                  3,
                  3
                ],
                [
                  3,
                  3
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "input_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv1",
            "class_name": "Conv2D",
            "config": {
              "name": "conv1",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                7,
                7
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv1_pad",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn_conv1",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn_conv1",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_283",
            "class_name": "Activation",
            "config": {
              "name": "activation_283",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "pool1_pad",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "pool1_pad",
              "trainable": true,
              "padding": [
                [
                  1,
                  1
                ],
                [
                  1,
                  1
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "activation_283",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "max_pooling2d_5",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_5",
              "trainable": true,
              "pool_size": [
                3,
                3
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "pool1_pad",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2a_branch2a",
            "class_name": "Conv2D",
            "config": {
              "name": "res2a_branch2a",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "max_pooling2d_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2a_branch2a",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2a_branch2a",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2a_branch2a",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_284",
            "class_name": "Activation",
            "config": {
              "name": "activation_284",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn2a_branch2a",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2a_branch2b",
            "class_name": "Conv2D",
            "config": {
              "name": "res2a_branch2b",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_284",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2a_branch2b",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2a_branch2b",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2a_branch2b",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_285",
            "class_name": "Activation",
            "config": {
              "name": "activation_285",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn2a_branch2b",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2a_branch2c",
            "class_name": "Conv2D",
            "config": {
              "name": "res2a_branch2c",
              "trainable": true,
              "filters": 256,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_285",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2a_branch1",
            "class_name": "Conv2D",
            "config": {
              "name": "res2a_branch1",
              "trainable": true,
              "filters": 256,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "max_pooling2d_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2a_branch2c",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2a_branch2c",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2a_branch2c",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2a_branch1",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2a_branch1",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2a_branch1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "add_5",
            "class_name": "Add",
            "config": {
              "name": "add_5",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "bn2a_branch2c",
                  0,
                  0,
                  {}
                ],
                [
                  "bn2a_branch1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_286",
            "class_name": "Activation",
            "config": {
              "name": "activation_286",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "add_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2b_branch2a",
            "class_name": "Conv2D",
            "config": {
              "name": "res2b_branch2a",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_286",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2b_branch2a",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2b_branch2a",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2b_branch2a",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_287",
            "class_name": "Activation",
            "config": {
              "name": "activation_287",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn2b_branch2a",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2b_branch2b",
            "class_name": "Conv2D",
            "config": {
              "name": "res2b_branch2b",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_287",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2b_branch2b",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2b_branch2b",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2b_branch2b",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_288",
            "class_name": "Activation",
            "config": {
              "name": "activation_288",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn2b_branch2b",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2b_branch2c",
            "class_name": "Conv2D",
            "config": {
              "name": "res2b_branch2c",
              "trainable": true,
              "filters": 256,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_288",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2b_branch2c",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2b_branch2c",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2b_branch2c",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "add_6",
            "class_name": "Add",
            "config": {
              "name": "add_6",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "bn2b_branch2c",
                  0,
                  0,
                  {}
                ],
                [
                  "activation_286",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_289",
            "class_name": "Activation",
            "config": {
              "name": "activation_289",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "add_6",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2c_branch2a",
            "class_name": "Conv2D",
            "config": {
              "name": "res2c_branch2a",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_289",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2c_branch2a",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2c_branch2a",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2c_branch2a",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_290",
            "class_name": "Activation",
            "config": {
              "name": "activation_290",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn2c_branch2a",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2c_branch2b",
            "class_name": "Conv2D",
            "config": {
              "name": "res2c_branch2b",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_290",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2c_branch2b",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2c_branch2b",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2c_branch2b",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_291",
            "class_name": "Activation",
            "config": {
              "name": "activation_291",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn2c_branch2b",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res2c_branch2c",
            "class_name": "Conv2D",
            "config": {
              "name": "res2c_branch2c",
              "trainable": true,
              "filters": 256,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_291",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn2c_branch2c",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn2c_branch2c",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res2c_branch2c",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "add_7",
            "class_name": "Add",
            "config": {
              "name": "add_7",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "bn2c_branch2c",
                  0,
                  0,
                  {}
                ],
                [
                  "activation_289",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_292",
            "class_name": "Activation",
            "config": {
              "name": "activation_292",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "add_7",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res3a_branch2a",
            "class_name": "Conv2D",
            "config": {
              "name": "res3a_branch2a",
              "trainable": true,
              "filters": 128,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_292",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn3a_branch2a",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn3a_branch2a",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res3a_branch2a",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_293",
            "class_name": "Activation",
            "config": {
              "name": "activation_293",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn3a_branch2a",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res3a_branch2b",
            "class_name": "Conv2D",
            "config": {
              "name": "res3a_branch2b",
              "trainable": true,
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_293",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn3a_branch2b",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn3a_branch2b",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res3a_branch2b",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_294",
            "class_name": "Activation",
            "config": {
              "name": "activation_294",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "bn3a_branch2b",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res3a_branch2c",
            "class_name": "Conv2D",
            "config": {
              "name": "res3a_branch2c",
              "trainable": true,
              "filters": 512,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_294",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "res3a_branch1",
            "class_name": "Conv2D",
            "config": {
              "name": "res3a_branch1",
              "trainable": true,
              "filters": 512,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 2.0,
                  "mode": "fan_in",
                  "distribution": "normal",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_292",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn3a_branch2c",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn3a_branch2c",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "res3a_branch2c",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn3a_branch1",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn3a_branch1",
              "trainable": true,
              "axis": 3,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
