{
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of25",
        "group1-shard2of25",
        "group1-shard3of25",
        "group1-shard4of25",
        "group1-shard5of25",
        "group1-shard6of25",
        "group1-shard7of25",
        "group1-shard8of25",
        "group1-shard9of25",
        "group1-shard10of25",
        "group1-shard11of25",
        "group1-shard12of25",
        "group1-shard13of25",
        "group1-shard14of25",
        "group1-shard15of25",
        "group1-shard16of25",
        "group1-shard17of25",
        "group1-shard18of25",
        "group1-shard19of25",
        "group1-shard20of25",
        "group1-shard21of25",
        "group1-shard22of25",
        "group1-shard23of25",
        "group1-shard24of25",
        "group1-shard25of25"
      ],
      "weights": [
        {
          "shape": [
            256
          ],
          "name": "bn2a_branch1/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2a_branch1/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2a_branch1/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2a_branch1/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2a_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2a_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2a_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2a_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2a_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2a_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2a_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2a_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2a_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2a_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2a_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2a_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2b_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2b_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2b_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2b_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2b_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2b_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2b_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2b_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2b_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2b_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2b_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2b_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2c_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2c_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2c_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2c_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2c_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2c_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2c_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn2c_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2c_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2c_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2c_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn2c_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3a_branch1/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3a_branch1/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3a_branch1/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3a_branch1/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3a_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3a_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3a_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3a_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3a_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3a_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3a_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3a_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3a_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3a_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3a_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3a_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3b_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3b_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3b_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3b_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3b_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3b_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3b_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3b_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3b_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3b_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3b_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3b_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3c_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3c_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3c_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3c_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3c_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3c_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3c_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3c_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3c_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3c_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3c_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3c_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3d_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3d_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3d_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3d_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3d_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3d_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3d_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "bn3d_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3d_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3d_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3d_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn3d_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4a_branch1/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4a_branch1/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4a_branch1/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4a_branch1/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4a_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4a_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4a_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4a_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4a_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4a_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4a_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4a_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4a_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4a_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4a_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4a_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4b_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4b_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4b_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4b_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4b_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4b_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4b_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4b_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4b_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4b_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4b_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4b_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4c_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4c_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4c_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4c_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4c_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4c_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4c_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4c_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4c_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4c_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4c_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4c_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4d_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4d_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4d_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4d_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4d_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4d_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4d_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4d_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4d_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4d_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4d_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4d_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4e_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4e_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4e_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4e_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4e_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4e_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4e_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4e_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4e_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4e_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4e_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4e_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4f_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4f_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4f_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4f_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4f_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4f_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4f_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "bn4f_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4f_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4f_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4f_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "bn4f_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5a_branch1/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5a_branch1/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5a_branch1/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5a_branch1/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5a_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5a_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5a_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5a_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5a_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5a_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5a_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5a_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5a_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5a_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5a_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5a_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5b_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5b_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5b_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5b_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5b_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5b_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5b_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5b_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5b_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5b_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5b_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5b_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5c_branch2a/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5c_branch2a/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5c_branch2a/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5c_branch2a/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5c_branch2b/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5c_branch2b/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5c_branch2b/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "bn5c_branch2b/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5c_branch2c/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5c_branch2c/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5c_branch2c/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "bn5c_branch2c/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn_conv1/gamma",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn_conv1/beta",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn_conv1/moving_mean",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "bn_conv1/moving_variance",
          "dtype": "float32"
        },
        {
          "shape": [
            7,
            7,
            3,
            64
          ],
          "name": "conv1/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "conv1/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            2048,
            1000
          ],
          "name": "fc1000/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            1000
          ],
          "name": "fc1000/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            64,
            256
          ],
          "name": "res2a_branch1/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res2a_branch1/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            64,
            64
          ],
          "name": "res2a_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "res2a_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            64,
            64
          ],
          "name": "res2a_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "res2a_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            64,
            256
          ],
          "name": "res2a_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res2a_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            64
          ],
          "name": "res2b_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "res2b_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            64,
            64
          ],
          "name": "res2b_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "res2b_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            64,
            256
          ],
          "name": "res2b_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res2b_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            64
          ],
          "name": "res2c_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "res2c_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            64,
            64
          ],
          "name": "res2c_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            64
          ],
          "name": "res2c_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            64,
            256
          ],
          "name": "res2c_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res2c_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            512
          ],
          "name": "res3a_branch1/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res3a_branch1/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            128
          ],
          "name": "res3a_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "res3a_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            128,
            128
          ],
          "name": "res3a_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "res3a_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            128,
            512
          ],
          "name": "res3a_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res3a_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            512,
            128
          ],
          "name": "res3b_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "res3b_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            128,
            128
          ],
          "name": "res3b_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "res3b_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            128,
            512
          ],
          "name": "res3b_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res3b_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            512,
            128
          ],
          "name": "res3c_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "res3c_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            128,
            128
          ],
          "name": "res3c_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "res3c_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            128,
            512
          ],
          "name": "res3c_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res3c_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            512,
            128
          ],
          "name": "res3d_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "res3d_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            128,
            128
          ],
          "name": "res3d_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            128
          ],
          "name": "res3d_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            128,
            512
          ],
          "name": "res3d_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res3d_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            512,
            1024
          ],
          "name": "res4a_branch1/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "res4a_branch1/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            512,
            256
          ],
          "name": "res4a_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4a_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            256,
            256
          ],
          "name": "res4a_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4a_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            1024
          ],
          "name": "res4a_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "res4a_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            1024,
            256
          ],
          "name": "res4b_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4b_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            256,
            256
          ],
          "name": "res4b_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4b_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            1024
          ],
          "name": "res4b_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "res4b_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            1024,
            256
          ],
          "name": "res4c_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4c_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            256,
            256
          ],
          "name": "res4c_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4c_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            1024
          ],
          "name": "res4c_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "res4c_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            1024,
            256
          ],
          "name": "res4d_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4d_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            256,
            256
          ],
          "name": "res4d_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4d_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            1024
          ],
          "name": "res4d_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "res4d_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            1024,
            256
          ],
          "name": "res4e_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4e_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            256,
            256
          ],
          "name": "res4e_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4e_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            1024
          ],
          "name": "res4e_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "res4e_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            1024,
            256
          ],
          "name": "res4f_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4f_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            256,
            256
          ],
          "name": "res4f_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            256
          ],
          "name": "res4f_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            256,
            1024
          ],
          "name": "res4f_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            1024
          ],
          "name": "res4f_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            1024,
            2048
          ],
          "name": "res5a_branch1/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "res5a_branch1/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            1024,
            512
          ],
          "name": "res5a_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res5a_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            512,
            512
          ],
          "name": "res5a_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res5a_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            512,
            2048
          ],
          "name": "res5a_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "res5a_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            2048,
            512
          ],
          "name": "res5b_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res5b_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            512,
            512
          ],
          "name": "res5b_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res5b_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            512,
            2048
          ],
          "name": "res5b_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "res5b_branch2c/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            2048,
            512
          ],
          "name": "res5c_branch2a/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res5c_branch2a/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            3,
            3,
            512,
            512
          ],
          "name": "res5c_branch2b/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            512
          ],
          "name": "res5c_branch2b/bias",
          "dtype": "float32"
        },
        {
          "shape": [
            1,
            1,
            512,
            2048
          ],
          "name": "res5c_branch2c/kernel",
          "dtype": "float32"
        },
        {
          "shape": [
            2048
          ],
          "name": "res5c_branch2c/bias",
          "dtype": "float32"
        }
      ]
    }
  ],
  "modelTopology": {
    "backend": "tensorflow",
    "model_config": {
      "config": {
        "output_layers": [
          [
            "fc1000",
            0,
            0
          ]
        ],
        "name": "resnet50",
        "layers": [
          {
            "config": {
              "batch_input_shape": [
                null,
                224,
                224,
                3
              ],
              "sparse": false,
              "name": "input_1",
              "dtype": "float32"
            },
            "inbound_nodes": [],
            "name": "input_1",
            "class_name": "InputLayer"
          },
          {
            "config": {
