{"modelTopology": {"backend": "tensorflow", "keras_version": "2.1.6-tf", "model_config": {"config": {"output_layers": [["predictions", 0, 0]], "name": "inception_v3", "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "filters": 32, "name": "conv2d", "use_bias": false, "strides": [2, 2], "activation": "linear"}, "name": "conv2d", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation", "activation": "relu", "trainable": true}, "name": "activation", "class_name": "Activation"}, {"inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "filters": 32, "name": "conv2d_1", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_1", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_1", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_1", "activation": "relu", "trainable": true}, "name": "activation_1", "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_2", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_2", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_2", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_2", "activation": "relu", "trainable": true}, "name": "activation_2", "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [3, 3], "name": "max_pooling2d", "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "name": "max_pooling2d", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "filters": 80, "name": "conv2d_3", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_3", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_3", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_3", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_3", "activation": "relu", "trainable": true}, "name": "activation_3", "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "filters": 192, "name": "conv2d_4", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_4", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_4", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_4", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_4", "activation": "relu", "trainable": true}, "name": "activation_4", "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [3, 3], "name": "max_pooling2d_1", "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_8", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_8", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_8", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_8", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_8", "activation": "relu", "trainable": true}, "name": "activation_8", "class_name": "Activation"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 48, "name": "conv2d_6", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 96, "name": "conv2d_9", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_9", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_6", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_6", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_9", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_9", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_6", "activation": "relu", "trainable": true}, "name": "activation_6", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_9", "activation": "relu", "trainable": true}, "name": "activation_9", "class_name": "Activation"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [3, 3], "name": "average_pooling2d", "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "trainable": true}, "name": "average_pooling2d", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_5", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_7", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_7", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 96, "name": "conv2d_10", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_10", "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 32, "name": "conv2d_11", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_11", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_5", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_5", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_7", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_7", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_10", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_10", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_11", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_11", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_5", "activation": "relu", "trainable": true}, "name": "activation_5", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_7", "activation": "relu", "trainable": true}, "name": "activation_7", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_10", "activation": "relu", "trainable": true}, "name": "activation_10", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_11", "activation": "relu", "trainable": true}, "name": "activation_11", "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0, {}], ["activation_7", 0, 0, {}], ["activation_10", 0, 0, {}], ["activation_11", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "mixed0", "axis": 3}, "name": "mixed0", "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_15", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_15", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_15", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_15", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_15", "activation": "relu", "trainable": true}, "name": "activation_15", "class_name": "Activation"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 48, "name": "conv2d_13", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_13", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 96, "name": "conv2d_16", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_16", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_13", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_13", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_16", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_16", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_13", "activation": "relu", "trainable": true}, "name": "activation_13", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_16", "activation": "relu", "trainable": true}, "name": "activation_16", "class_name": "Activation"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [3, 3], "name": "average_pooling2d_1", "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "trainable": true}, "name": "average_pooling2d_1", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_12", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_12", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_14", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_14", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 96, "name": "conv2d_17", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_17", "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_18", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_18", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_12", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_12", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_14", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_14", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_17", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_17", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_18", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_18", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_12", "activation": "relu", "trainable": true}, "name": "activation_12", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_14", "activation": "relu", "trainable": true}, "name": "activation_14", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_17", "activation": "relu", "trainable": true}, "name": "activation_17", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_18", "activation": "relu", "trainable": true}, "name": "activation_18", "class_name": "Activation"}, {"inbound_nodes": [[["activation_12", 0, 0, {}], ["activation_14", 0, 0, {}], ["activation_17", 0, 0, {}], ["activation_18", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "mixed1", "axis": 3}, "name": "mixed1", "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_22", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_22", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_22", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_22", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_22", "activation": "relu", "trainable": true}, "name": "activation_22", "class_name": "Activation"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 48, "name": "conv2d_20", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_20", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 96, "name": "conv2d_23", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_23", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_20", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_20", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_23", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_23", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_20", "activation": "relu", "trainable": true}, "name": "activation_20", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_23", "activation": "relu", "trainable": true}, "name": "activation_23", "class_name": "Activation"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [3, 3], "name": "average_pooling2d_2", "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "trainable": true}, "name": "average_pooling2d_2", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_19", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_19", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_21", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_21", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 96, "name": "conv2d_24", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_24", "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_25", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_25", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_19", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_19", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_21", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_21", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_24", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_24", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_25", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_25", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_19", "activation": "relu", "trainable": true}, "name": "activation_19", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_21", "activation": "relu", "trainable": true}, "name": "activation_21", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_24", "activation": "relu", "trainable": true}, "name": "activation_24", "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_25", "activation": "relu", "trainable": true}, "name": "activation_25", "class_name": "Activation"}, {"inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}], ["activation_25", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "mixed2", "axis": 3}, "name": "mixed2", "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 64, "name": "conv2d_27", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_27", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_27", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_27", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_27", "activation": "relu", "trainable": true}, "name": "activation_27", "class_name": "Activation"}, {"inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "same", "filters": 96, "name": "conv2d_28", "use_bias": false, "strides": [1, 1], "activation": "linear"}, "name": "conv2d_28", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "epsilon": 0.001, "axis": [3], "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_28", "gamma_constraint": null, "dtype": "float32", "trainable": true, "momentum": 0.99, "scale": false, "center": true}, "name": "batch_normalization_28", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"dtype": "float32", "name": "activation_28", "activation": "relu", "trainable": true}, "name": "activation_28", "class_name": "Activation"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "filters": 384, "name": "conv2d_26", "use_bias": false, "strides": [2, 2], "activation": "linear"}, "name": "conv2d_26", "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "filters": 96, "name": "conv2d_29", "use_bias": false, "strides": [2, 2], "activation": "linear"}, "name": "conv2d_29", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]],