{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.0.1",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "mobilenetv2_1.40_224",
        "layers": [
          {
            "name": "input_1",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                224,
                224,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            },
            "inbound_nodes": []
          },
          {
            "name": "Conv1_pad",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "Conv1_pad",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [
                  0,
                  1
                ],
                [
                  0,
                  1
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "Conv1",
            "class_name": "Conv2D",
            "config": {
              "name": "Conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 48,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "Conv1_pad",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "bn_Conv1",
            "class_name": "BatchNormalization",
            "config": {
              "name": "bn_Conv1",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "Conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "Conv1_relu",
            "class_name": "ReLU",
            "config": {
              "name": "Conv1_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "bn_Conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "expanded_conv_depthwise",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "expanded_conv_depthwise",
              "trainable": true,
              "dtype": "float32",
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "Conv1_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "expanded_conv_depthwise_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "expanded_conv_depthwise_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "expanded_conv_depthwise",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "expanded_conv_depthwise_relu",
            "class_name": "ReLU",
            "config": {
              "name": "expanded_conv_depthwise_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "expanded_conv_depthwise_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "expanded_conv_project",
            "class_name": "Conv2D",
            "config": {
              "name": "expanded_conv_project",
              "trainable": true,
              "dtype": "float32",
              "filters": 24,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "expanded_conv_depthwise_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "expanded_conv_project_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "expanded_conv_project_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "expanded_conv_project",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_expand",
            "class_name": "Conv2D",
            "config": {
              "name": "block_1_expand",
              "trainable": true,
              "dtype": "float32",
              "filters": 144,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "expanded_conv_project_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_expand_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_1_expand_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_1_expand",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_expand_relu",
            "class_name": "ReLU",
            "config": {
              "name": "block_1_expand_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "block_1_expand_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_pad",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "block_1_pad",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [
                  0,
                  1
                ],
                [
                  0,
                  1
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block_1_expand_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_depthwise",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "block_1_depthwise",
              "trainable": true,
              "dtype": "float32",
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_1_pad",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_depthwise_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_1_depthwise_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_1_depthwise",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_depthwise_relu",
            "class_name": "ReLU",
            "config": {
              "name": "block_1_depthwise_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "block_1_depthwise_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_project",
            "class_name": "Conv2D",
            "config": {
              "name": "block_1_project",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_1_depthwise_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_1_project_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_1_project_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_1_project",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_expand",
            "class_name": "Conv2D",
            "config": {
              "name": "block_2_expand",
              "trainable": true,
              "dtype": "float32",
              "filters": 192,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_1_project_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_expand_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_2_expand_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_2_expand",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_expand_relu",
            "class_name": "ReLU",
            "config": {
              "name": "block_2_expand_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "block_2_expand_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_depthwise",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "block_2_depthwise",
              "trainable": true,
              "dtype": "float32",
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_2_expand_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_depthwise_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_2_depthwise_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_2_depthwise",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_depthwise_relu",
            "class_name": "ReLU",
            "config": {
              "name": "block_2_depthwise_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "block_2_depthwise_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_project",
            "class_name": "Conv2D",
            "config": {
              "name": "block_2_project",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_2_depthwise_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_project_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_2_project_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_2_project",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_2_add",
            "class_name": "Add",
            "config": {
              "name": "block_2_add",
              "trainable": true,
              "dtype": "float32"
            },
            "inbound_nodes": [
              [
                [
                  "block_1_project_BN",
                  0,
                  0,
                  {}
                ],
                [
                  "block_2_project_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_expand",
            "class_name": "Conv2D",
            "config": {
              "name": "block_3_expand",
              "trainable": true,
              "dtype": "float32",
              "filters": 192,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_2_add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_expand_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_3_expand_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_3_expand",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_expand_relu",
            "class_name": "ReLU",
            "config": {
              "name": "block_3_expand_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "block_3_expand_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_pad",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "block_3_pad",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [
                  0,
                  1
                ],
                [
                  0,
                  1
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block_3_expand_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_depthwise",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "block_3_depthwise",
              "trainable": true,
              "dtype": "float32",
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_3_pad",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_depthwise_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_3_depthwise_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_3_depthwise",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_depthwise_relu",
            "class_name": "ReLU",
            "config": {
              "name": "block_3_depthwise_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "block_3_depthwise_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_project",
            "class_name": "Conv2D",
            "config": {
              "name": "block_3_project",
              "trainable": true,
              "dtype": "float32",
              "filters": 48,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_3_depthwise_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_3_project_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_3_project_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_3_project",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_4_expand",
            "class_name": "Conv2D",
            "config": {
              "name": "block_4_expand",
              "trainable": true,
              "dtype": "float32",
              "filters": 288,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_3_project_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_4_expand_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_4_expand_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {
                  "dtype": "float32"
                }
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_4_expand",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_4_expand_relu",
            "class_name": "ReLU",
            "config": {
              "name": "block_4_expand_relu",
              "trainable": true,
              "dtype": "float32",
              "max_value": 6.0,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "inbound_nodes": [
              [
                [
                  "block_4_expand_BN",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_4_depthwise",
            "class_name": "DepthwiseConv2D",
            "config": {
              "name": "block_4_depthwise",
              "trainable": true,
              "dtype": "float32",
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "depthwise_regularizer": null,
              "depthwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block_4_expand_relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block_4_depthwise_BN",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block_4_depthwise_BN",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.999,
              "epsilon": 0.001,
              "center": true,
