{"weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 1, 32]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [32]}, {"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [64]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [9216, 128]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [128]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [128, 10]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [10]}]}], "modelTopology": {"keras_version": "2.0.4", "model_config": {"config": [{"config": {"strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "filters": 32, "activation": "relu", "activity_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "activity_regularizer": null, "padding": "valid", "activation": "relu", "trainable": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 128, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 10, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2", "activation": "softmax", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow", "training_config": {"optimizer_config": {"config": {"rho": 0.95, "lr": 1.0, "epsilon": 1e-08, "decay": 0.0}, "class_name": "Adadelta"}, "loss_weights": null, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "sample_weight_mode": null}}}