{
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of22",
        "group1-shard2of22",
        "group1-shard3of22",
        "group1-shard4of22",
        "group1-shard5of22",
        "group1-shard6of22",
        "group1-shard7of22",
        "group1-shard8of22",
        "group1-shard9of22",
        "group1-shard10of22",
        "group1-shard11of22",
        "group1-shard12of22",
        "group1-shard13of22",
        "group1-shard14of22",
        "group1-shard15of22",
        "group1-shard16of22",
        "group1-shard17of22",
        "group1-shard18of22",
        "group1-shard19of22",
        "group1-shard20of22",
        "group1-shard21of22",
        "group1-shard22of22"
      ],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/gamma",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/beta",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_mean",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_variance",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv3/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv3/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv3_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv3_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv3_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block10_sepconv3_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv3/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv3/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv3_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv3_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv3_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block11_sepconv3_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv3/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv3/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv3_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv3_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv3_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block12_sepconv3_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv2_bn/gamma",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv2_bn/beta",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv2_bn/moving_mean",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "block13_sepconv2_bn/moving_variance",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            1024,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            1024,
            1536
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv1_bn/gamma",
          "shape": [
            1536
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv1_bn/beta",
          "shape": [
            1536
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv1_bn/moving_mean",
          "shape": [
            1536
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv1_bn/moving_variance",
          "shape": [
            1536
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            1536,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            1536,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv2_bn/gamma",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv2_bn/beta",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv2_bn/moving_mean",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "block14_sepconv2_bn/moving_variance",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1_bn/gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1_bn/beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1_bn/moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1_bn/moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv2/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv2_bn/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv2_bn/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv2_bn/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv2_bn/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv1_bn/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv1_bn/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv1_bn/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv1_bn/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            128,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv2_bn/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv2_bn/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv2_bn/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_sepconv2_bn/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            128,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv1_bn/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv1_bn/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv1_bn/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv1_bn/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            256,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            256,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv2_bn/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv2_bn/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv2_bn/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_sepconv2_bn/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            256,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            256,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv3/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv3/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv3_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv3_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv3_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block5_sepconv3_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv3/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv3/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv3_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv3_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv3_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block6_sepconv3_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv3/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv3/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv3_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv3_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv3_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block7_sepconv3_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv3/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv3/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv3_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv3_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv3_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block8_sepconv3_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv1/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv1/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv1_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv1_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv1_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv1_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv2/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv2/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv2_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv2_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv2_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv2_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv3/depthwise_kernel",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv3/pointwise_kernel",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv3_bn/gamma",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv3_bn/beta",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv3_bn/moving_mean",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "block9_sepconv3_bn/moving_variance",
          "shape": [
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d/kernel",
          "shape": [
            1,
            1,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/kernel",
          "shape": [
            1,
            1,
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            1,
            1,
            256,
            728
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_3/kernel",
          "shape": [
            1,
            1,
            728,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "predictions/kernel",
          "shape": [
            2048,
            1000
          ],
          "dtype": "float32"
        },
        {
          "name": "predictions/bias",
          "shape": [
            1000
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "modelTopology": {
    "keras_version": "2.1.6-tf",
    "model_config": {
      "config": {
        "output_layers": [
          [
            "predictions",
            0,
            0
          ]
        ],
        "name": "xception",
        "input_layers": [
          [
            "input_1",
            0,
            0
          ]
        ],
        "layers": [
          {
            "name": "input_1",
            "config": {
              "sparse": false,
              "dtype": "float32",
              "batch_input_shape": [
                null,
                299,
                299,
                3
              ],
              "name": "input_1"
            },
            "class_name": "InputLayer",
            "inbound_nodes": []
          },
          {
            "name": "block1_conv1",
            "config": {
              "dtype": "float32",
              "filters": 32,
              "dilation_rate": [
                1,
                1
              ],
              "data_format": "channels_last",
              "use_bias": false,
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "name": "block1_conv1",
              "padding": "valid",
              "trainable": true,
              "kernel_size": [
                3,
                3
              ],
              "kernel_constraint": null,
              "strides": [
                2,
                2
              ],
              "activity_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "depthwise_initializer": {
                "config": {
                  "mode": "fan_avg",
                  "dtype": "float32",
                  "scale": 1.0,
                  "distribution": "uniform",
                  "seed": null
                },
                "class_name": "VarianceScaling"
              },
              "bias_regularizer": null,
              "kernel_regularizer": null
            },
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv1_bn",
            "config": {
              "dtype": "float32",
              "name": "block1_conv1_bn",
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "axis": [
                3
              ],
              "trainable": true,
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "beta_regularizer": null,
              "scale": true,
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "gamma_constraint": null,
              "beta_constraint": null,
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "momentum": 0.99
            },
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "block1_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv1_act",
            "config": {
              "dtype": "float32",
              "activation": "relu",
              "trainable": true,
              "name": "block1_conv1_act"
            },
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "block1_conv1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv2",
            "config": {
              "dtype": "float32",
              "filters": 64,
              "dilation_rate": [
                1,
                1
              ],
              "data_format": "channels_last",
              "use_bias": false,
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "name": "block1_conv2",
              "padding": "valid",
              "trainable": true,
              "kernel_size": [
                3,
                3
              ],
              "kernel_constraint": null,
              "strides": [
                1,
                1
              ],
              "activity_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "depthwise_initializer": {
                "config": {
                  "mode": "fan_avg",
                  "dtype": "float32",
                  "scale": 1.0,
                  "distribution": "uniform",
                  "seed": null
                },
                "class_name": "VarianceScaling"
              },
              "bias_regularizer": null,
              "kernel_regularizer": null
            },
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "block1_conv1_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv2_bn",
            "config": {
              "dtype": "float32",
              "name": "block1_conv2_bn",
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "axis": [
                3
              ],
              "trainable": true,
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "beta_regularizer": null,
              "scale": true,
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "gamma_constraint": null,
              "beta_constraint": null,
              "gamma_regularizer": null,
              "epsilon": 0.001,
              "momentum": 0.99
            },
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "block1_conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv2_act",
            "config": {
              "dtype": "float32",
              "activation": "relu",
              "trainable": true,
              "name": "block1_conv2_act"
            },
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "block1_conv2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_sepconv1",
            "config": {
              "pointwise_regularizer": null,
              "pointwise_constraint": null,
              "data_format": "channels_last",
              "name": "block2_sepconv1",
              "trainable": true,
              "depthwise_initializer": {
                "config": {
                  "mode": "fan_avg",
                  "dtype": "float32",
                  "scale": 1.0,
                  "distribution": "uniform",
                  "seed": null
                },
                "class_name": "VarianceScaling"
              },
              "activity_regularizer": null,
              "activation": "linear",
              "depthwise_initializer": {
                "config": {
                  "mode": "fan_avg",
                  "dtype": "float32",
                  "scale": 1.0,
                  "distribution": "uniform",
                  "seed": null
                },
                "class_name": "VarianceScaling"
              },
              "dtype": "float32",
              "filters": 128,
              "dilation_rate": [
                1,
                1
              ],
              "use_bias": false,
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "depthwise_regularizer": null,
              "padding": "same",
              "kernel_size": [
                3,
                3
              ],
              "depthwise_constraint": null,
              "kernel_constraint": null,
              "strides": [
                1,
                1
              ],
              "bias_constraint": null,
              "bias_regularizer": null,
              "pointwise_initializer": {
                "config": {
                  "mode": "fan_avg",
                  "dtype": "float32",
                  "scale": 1.0,
                  "distribution": "uniform",
                  "seed": null
                },
                "class_name": "VarianceScaling"
              },
