{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4",
  "convertedBy": "TensorFlow.js Converter v1.0.1",
  "modelTopology": {
    "keras_version": "2.2.4",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "xception",
        "layers": [
          {
            "name": "input_6",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                299,
                299,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_6"
            },
            "inbound_nodes": []
          },
          {
            "name": "block1_conv1",
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv1",
              "trainable": true,
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "input_6",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv1_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block1_conv1_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv1_act",
            "class_name": "Activation",
            "config": {
              "name": "block1_conv1_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv2",
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv2",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv1_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv2_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block1_conv2_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv2_act",
            "class_name": "Activation",
            "config": {
              "name": "block1_conv2_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_sepconv1",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block2_sepconv1",
              "trainable": true,
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv2_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_sepconv1_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block2_sepconv1_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block2_sepconv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_sepconv2_act",
            "class_name": "Activation",
            "config": {
              "name": "block2_sepconv2_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "block2_sepconv1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_sepconv2",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block2_sepconv2",
              "trainable": true,
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block2_sepconv2_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_sepconv2_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block2_sepconv2_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block2_sepconv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv2d_95",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_95",
              "trainable": true,
              "filters": 128,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv2_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_pool",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block2_pool",
              "trainable": true,
              "pool_size": [
                3,
                3
              ],
              "padding": "same",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block2_sepconv2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "batch_normalization_95",
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_95",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv2d_95",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "add_21",
            "class_name": "Add",
            "config": {
              "name": "add_21",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "block2_pool",
                  0,
                  0,
                  {}
                ],
                [
                  "batch_normalization_95",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_sepconv1_act",
            "class_name": "Activation",
            "config": {
              "name": "block3_sepconv1_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "add_21",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_sepconv1",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block3_sepconv1",
              "trainable": true,
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block3_sepconv1_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_sepconv1_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block3_sepconv1_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block3_sepconv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_sepconv2_act",
            "class_name": "Activation",
            "config": {
              "name": "block3_sepconv2_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "block3_sepconv1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_sepconv2",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block3_sepconv2",
              "trainable": true,
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block3_sepconv2_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_sepconv2_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block3_sepconv2_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block3_sepconv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv2d_96",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_96",
              "trainable": true,
              "filters": 256,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "add_21",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_pool",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block3_pool",
              "trainable": true,
              "pool_size": [
                3,
                3
              ],
              "padding": "same",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block3_sepconv2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "batch_normalization_96",
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_96",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv2d_96",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "add_22",
            "class_name": "Add",
            "config": {
              "name": "add_22",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "block3_pool",
                  0,
                  0,
                  {}
                ],
                [
                  "batch_normalization_96",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_sepconv1_act",
            "class_name": "Activation",
            "config": {
              "name": "block4_sepconv1_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "add_22",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_sepconv1",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block4_sepconv1",
              "trainable": true,
              "filters": 728,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block4_sepconv1_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_sepconv1_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block4_sepconv1_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block4_sepconv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_sepconv2_act",
            "class_name": "Activation",
            "config": {
              "name": "block4_sepconv2_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "block4_sepconv1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_sepconv2",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block4_sepconv2",
              "trainable": true,
              "filters": 728,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block4_sepconv2_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_sepconv2_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block4_sepconv2_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block4_sepconv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv2d_97",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_97",
              "trainable": true,
              "filters": 728,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                2,
                2
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "add_22",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_pool",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block4_pool",
              "trainable": true,
              "pool_size": [
                3,
                3
              ],
              "padding": "same",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block4_sepconv2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "batch_normalization_97",
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_97",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv2d_97",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "add_23",
            "class_name": "Add",
            "config": {
              "name": "add_23",
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "block4_pool",
                  0,
                  0,
                  {}
                ],
                [
                  "batch_normalization_97",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block5_sepconv1_act",
            "class_name": "Activation",
            "config": {
              "name": "block5_sepconv1_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "add_23",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block5_sepconv1",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block5_sepconv1",
              "trainable": true,
              "filters": 728,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block5_sepconv1_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block5_sepconv1_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block5_sepconv1_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block5_sepconv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block5_sepconv2_act",
            "class_name": "Activation",
            "config": {
              "name": "block5_sepconv2_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "block5_sepconv1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block5_sepconv2",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block5_sepconv2",
              "trainable": true,
              "filters": 728,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block5_sepconv2_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block5_sepconv2_bn",
            "class_name": "BatchNormalization",
            "config": {
              "name": "block5_sepconv2_bn",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block5_sepconv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block5_sepconv3_act",
            "class_name": "Activation",
            "config": {
              "name": "block5_sepconv3_act",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "block5_sepconv2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block5_sepconv3",
            "class_name": "SeparableConv2D",
            "config": {
              "name": "block5_sepconv3",
              "trainable": true,
              "filters": 728,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": false,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "bias_constraint": null,
              "depth_multiplier": 1,
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "depthwise_regularizer": null,
              "pointwise_regularizer": null,
              "depthwise_constraint": null,
              "pointwise_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block5_sepconv3_act",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
